      / ****************************************************************
      / Copyright (c) IBM Corporation 2023
      / ****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWRD.

       PROCEDURE DIVISION.
           DISPLAY "SIMPLE HELLO WORLD".
           STOP RUN.