        PCB    TYPE=DB,DBDNAME=ACCOUNT,PROCOPT=AP,KEYLEN=8,            C
               PCBNAME=ACCOUNT
        SENSEG NAME=ACCOUNT,PARENT=0
        PCB    TYPE=DB,DBDNAME=ACCTYPE,PROCOPT=AP,KEYLEN=1,            C
               PCBNAME=ACCTYPE
        SENSEG NAME=ACCTYPE,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTACCS,PROCOPT=AP,KEYLEN=12,          C
               PCBNAME=CUSTACCS
        SENSEG NAME=CUSTACCS,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTOMER,PROCOPT=AP,KEYLEN=4,           C
               PCBNAME=CUSTOMER
        SENSEG NAME=CUSTOMER,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTTYPE,PROCOPT=AP,KEYLEN=1,           C
               PCBNAME=CUSTTYPE
        SENSEG NAME=CUSTTYPE,PARENT=0
        PCB    TYPE=DB,DBDNAME=HISTORY,PROCOPT=AP,KEYLEN=8,            C
               PCBNAME=HISTORY
        SENSEG NAME=HISTORY,PARENT=0
        PCB    TYPE=DB,DBDNAME=TSTAT,PROCOPT=AP,KEYLEN=8,              C
               PCBNAME=TSTAT
        SENSEG NAME=TSTAT,PARENT=0
        PCB    TYPE=DB,DBDNAME=TSTATTYP,PROCOPT=AP,KEYLEN=1,           C
               PCBNAME=TSTATTYP
        SENSEG NAME=TSTATTYP,PARENT=0
        PCB    TYPE=DB,DBDNAME=TTYPE,PROCOPT=AP,KEYLEN=1,              C
               PCBNAME=TTYPE
        SENSEG NAME=TTYPE,PARENT=0
        PSBGEN PSBNAME=IB,LANG=COBOL
        END