        PCB    TYPE=DB,DBDNAME=ACCOUNT,PROCOPT=G,KEYLEN=8,             C
               PCBNAME=ACCOUNT
        SENSEG NAME=ACCOUNT,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTACCS,PROCOPT=G,KEYLEN=12,           C
               PCBNAME=CUSTACCS
        SENSEG NAME=CUSTACCS,PARENT=0
        PSBGEN PSBNAME=IBACSUM,LANG=COBOL
        END