        PCB    TYPE=DB,DBDNAME=CUSTOMER,PROCOPT=G,KEYLEN=4,            C
               PCBNAME=CUSTOMER
        SENSEG NAME=CUSTOMER,PARENT=0
        PSBGEN PSBNAME=IBGCUDAT,LANG=COBOL
        END