        PCB    TYPE=DB,DBDNAME=ACCOUNT,PROCOPT=L,KEYLEN=8,             C
               PCBNAME=ACCOUNT
        SENSEG NAME=ACCOUNT,PARENT=0
        PCB    TYPE=DB,DBDNAME=ACCTYPE,PROCOPT=L,KEYLEN=1,             C
               PCBNAME=ACCTYPE
        SENSEG NAME=ACCTYPE,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTACCS,PROCOPT=L,KEYLEN=12,           C
               PCBNAME=CUSTACCS
        SENSEG NAME=CUSTACCS,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTOMER,PROCOPT=L,KEYLEN=4,            C
               PCBNAME=CUSTOMER
        SENSEG NAME=CUSTOMER,PARENT=0
        PCB    TYPE=DB,DBDNAME=CUSTTYPE,PROCOPT=L,KEYLEN=1,            C
               PCBNAME=CUSTTYPE
        SENSEG NAME=CUSTTYPE,PARENT=0
        PCB    TYPE=DB,DBDNAME=HISTORY,PROCOPT=L,KEYLEN=8,             C
               PCBNAME=HISTORY
        SENSEG NAME=HISTORY,PARENT=0
        PCB    TYPE=DB,DBDNAME=TSTAT,PROCOPT=L,KEYLEN=8,               C
               PCBNAME=TSTAT
        SENSEG NAME=TSTAT,PARENT=0
        PCB    TYPE=DB,DBDNAME=TSTATTYP,PROCOPT=L,KEYLEN=1,            C
               PCBNAME=TSTATTYP
        SENSEG NAME=TSTATTYP,PARENT=0
        PCB    TYPE=DB,DBDNAME=TTYPE,PROCOPT=L,KEYLEN=1,               C
               PCBNAME=TTYPE
        SENSEG NAME=TTYPE,PARENT=0
        PSBGEN PSBNAME=IBLOAD,LANG=COBOL
        END