        PCB    TYPE=DB,DBDNAME=CUSTOMER,PROCOPT=R,KEYLEN=4,            C
               PCBNAME=CUSTOMER
        SENSEG NAME=CUSTOMER,PARENT=0
        PSBGEN PSBNAME=IBSCUDAT,LANG=COBOL
        END