//******************************************************************************
//* Copyright (c) IBM Corporation 2025
//******************************************************************************
//******************************************************************************
//STEP1    EXEC PGM=BPXBATCH
//STDOUT   DD   SYSOUT=*                                               
//STDERR   DD   SYSOUT=*
//STDPARM  DD *
SH sleep 600
/*